# ---------------------------------------------------------------------
# 반복문 - 2 while 반복문
# - 반복의 횟수가 정해진 경우 사용 가능함
# ---------------------------------------------------------------------
# [요청] 사용자가 알고 싶어하는 단을 입력 받아서 구구단을 해당 단의 구구단을 출력하기
#       단, while 반복문 사용하기
# [예시] 알고 싶은 단 입력 :
#        -- 3단 --
#       3 * 1  = 3
#       3 * 2  = 6
#       3 * 3  = 9
#       3 * 4  = 12
#       3 * 5  = 15
#       3 * 6  = 18
#       3 * 7  = 21
#       3 * 8  = 24
#       3 * 9  = 27
# ---------------------------------------------------------------------

# 특정 단 출력
dan = int(input('단 입력 : '))
i = 1
while i <= 9:
    if i == 1:
        dan = str(dan) + '단'
        print(f'{dan:-^10}')
        dan = dan.replace('단', '')
        dan = int(dan)
        print(f'{dan} * {i} = {dan * i:2}')
    else:
        print(f'{dan} * {i} = {dan * i:2}')
    i += 1

# 2 ~ 9단 출력
i = 2
while i <= 9:
    i = str(i) + '단'
    print(f'{i:-^10}')
    i = int(i.replace('단', ''))
    for j in range(1, 10):
        print(f'{i} * {j} = {i * j:2}')
    print()
    i += 1

print()

i = 2
unit = '단'
while i <= 9:
    print(f'{i:->5}{unit:-<5}')
    for j in range(1, 10):
        print(f'{i} * {j} = {i * j:2}')
    print()
    i += 1

print()

i = 3
print(f'{i:->4}')
unit = '단'
print(f'{unit:-<4}')